[Room] Tags can only be placed in Floor Plan, Reflected Ceiling Plan and Section Views.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RoomTagBadViewType { get; }
  Visual Basic
Public Shared ReadOnly Property RoomTagBadViewType As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RoomTagBadViewType {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RoomFailures Class
  Autodesk.Revit.DB Namespace